In [297]:
import pandas as pd
import random

historia:
loty startuja z ziemi, za początek poczatek ukladu wspolrzednych uznajemy słońce.
im planeta w galaktyce dalej od ziemii tym:
- wiecej pracownikow
- drozszy lot
- mozliwe ze bedzie dostepny tylko w jedna strone

Im:
- statek ma wieksza capacity (wielkosc),
-
tym cena wyzsza

planety w jednej galaktyce maja zblizone wspolrzedne.


jak ktos pojechal tylko w jedna strone - to juz nie moze pojawic sie w transakcjach i bookingach.

niech salary pracownikow bedzie najwyzsze dla commander a najnizsze dla technitian i neich zalezy od doswiadczenia w firmie.

planets + coordinates + galaxy

In [298]:
# warsja rozszeżona o ruch orbitalny

import pandas as pd
import random
import numpy as np
from collections import defaultdict
import csv

# Nazwy galaktyk

with open('galaxies_example_names.csv', newline='', encoding='utf-8') as csvfile:
    reader = csv.reader(csvfile)
    next(reader)  # pomija nagłówek
    galaxies_example = [row[0] for row in reader]

# Losuj liczbę elementów między 12 a 15
num_to_select = random.randint(12, 15)

# Wybierz losowe, unikalne elementy z listy
galaxy_names = random.sample(galaxies_example, num_to_select)

# Nazwy systemów (bogowie, łacina, mitologia)

with open('systems_example_names.csv', newline='', encoding='utf-8') as csvfile:
    reader = csv.reader(csvfile)
    next(reader)  # pomija nagłówek
    system_names  = [row[0] for row in reader]


# Nazwy planet (mitologiczne, łacińskie)
with open('planets_example_names.csv', newline='', encoding='utf-8') as csvfile:
    reader = csv.reader(csvfile)
    next(reader)  # pomija nagłówek
    planet_names  = [row[0] for row in reader]

# Specjalne cechy
special_features_base = [
    "pink_sun", "comets_rain", "emerald_lakes", "diamond_rain", "1000*C",
    "huge_gravity", "sulfuric_acid_fog", "magnetic_storms", "glowing_mountains",
    "eternal_night", "frozen_oceans"
]

# === Inicjalizacja ===
galaxies = []
systems = []
planets = []

galaxy_coords = {}
system_coords = {}

system_id_counter = 1
planet_id_counter = 1

# Liczniki dla powtórzeń nazw
system_name_count = defaultdict(int)
planet_name_count = defaultdict(int)

# === GALAXY DATA ===
for i, name in enumerate(galaxy_names, start=1):
    galaxies.append({
        "galaxy_id": i,
        "galaxy": name
    })
    galaxy_coords[i] = {
        "base_x": random.uniform(-1000, 1000),
        "base_y": random.uniform(-1000, 1000),
        "base_z": random.uniform(-1000, 1000)
    }

# === PLANETARY SYSTEM DATA ===
for galaxy in galaxies:
    galaxy_id = galaxy["galaxy_id"]
    base = galaxy_coords[galaxy_id]

    num_systems = random.randint(2, 5)

    for _ in range(num_systems):
        raw_name = random.choice(system_names)
        system_name_count[raw_name] += 1
        name = raw_name if system_name_count[raw_name] == 1 else f"{raw_name}_{system_name_count[raw_name]}"

        x = round(base["base_x"] + random.uniform(-100, 100), 2)
        y = round(base["base_y"] + random.uniform(-100, 100), 2)
        z = round(base["base_z"] + random.uniform(-100, 100), 2)

        systems.append({
            "system_id": system_id_counter,
            "system": name,
            "central_star": f"{raw_name} Star",
            "x_coord": x,
            "y_coord": y,
            "z_coord": z,
            "galaxy_id": galaxy_id
        })

        system_coords[system_id_counter] = {"x": x, "y": y, "z": z}
        system_id_counter += 1

# === PLANET DATA ===
def generate_features():
    x = max(0, int(np.floor(np.random.normal(3, 2))))
    return random.sample(special_features_base, min(x, len(special_features_base)))

for system in systems:
    system_id = system["system_id"]
    base = system_coords[system_id]
    num_planets = random.randint(2, 7)

    for _ in range(num_planets):
        raw_name = random.choice(planet_names)
        planet_name_count[raw_name] += 1
        name = raw_name if planet_name_count[raw_name] == 1 else f"{raw_name}_{planet_name_count[raw_name]}"

        orbit_period_days = random.randint(50, 1000)
        features = generate_features()
        x0 = round(base["x"] + random.uniform(-10, 10), 2)
        y0 = round(base["y"] + random.uniform(-10, 10), 2)
        z0 = round(base["z"] + random.uniform(-10, 10), 2)

        planets.append({
            "planet_id": planet_id_counter,
            "planet": name,
            "system_id": system_id,
            "orbit_period_days": orbit_period_days,
            "special_features": ",".join(features),
            "day0_x_coord": x0,
            "day0_y_coord": y0,
            "day0_z_coord": z0
        })
        planet_id_counter += 1

# === DataFrames ===
df_galaxies = pd.DataFrame(galaxies)
df_systems = pd.DataFrame(systems)
df_planets = pd.DataFrame(planets)

# === Podgląd danych ===
print("Galaxies:")
print(df_galaxies.head(), "\n")

print("Systems:")
print(df_systems.head(), "\n")

print("Planets:")
print(df_planets.head(), "\n")

# Eksport (opcjonalny)
df_galaxies.to_csv("galaxy_final.csv", index=False)
df_systems.to_csv("planetary_system_final.csv", index=False)
df_planets.to_csv("planet_final.csv", index=False)

Galaxies:
   galaxy_id          galaxy
0          1   Zenithis Ring
1          2    Halion Verge
2          3    Quasari Belt
3          4       Voidspire
4          5  Crystara Bloom

Systems:
   system_id      system   central_star  x_coord  y_coord  z_coord  galaxy_id
0          1    Celereus  Celereus Star   510.30   839.57   131.28          1
1          2  Celereus_2  Celereus Star   631.76   869.94    97.16          1
2          3       Omnix     Omnix Star   684.13   886.54   214.67          1
3          4      Aquila    Aquila Star   563.96   806.29   178.77          1
4          5     Ilyssar   Ilyssar Star   570.00   889.18   270.64          1

Planets:
   planet_id    planet  system_id  orbit_period_days  \
0          1  Pasiphae          1                557
1          2      Iaso          1                737
2          3     Noxia          1                544
3          4  Thalassa          1                103
4          5   Panacea          1                856

                    special_features  day0_x_coord  day0_y_coord  day0_z_coord
0  1000*C,eternal_night,huge_gravity        500.59        847.46        134.06
1                                           502.07        836.14        133.08
2                  sulfuric_acid_fog        511.28        840.99        123.43
3             pink_sun,emerald_lakes        518.01        846.87        129.57
4                    1000*C,pink_sun        518.52        843.93        130.56

In [299]:
df_planets

,planet_id,planet,system_id,orbit_period_days,special_features,day0_x_coord,day0_y_coord,day0_z_coord
0,1,Pasiphae,1,557,"1000*C,eternal_night,huge_gravity",500.59,847.46,134.06
1,2,Iaso,1,737,,502.07,836.14,133.08
2,3,Noxia,1,544,sulfuric_acid_fog,511.28,840.99,123.43
3,4,Thalassa,1,103,"pink_sun,emerald_lakes",518.01,846.87,129.57
4,5,Panacea,1,856,"1000*C,pink_sun",518.52,843.93,130.56
...,...,...,...,...,...,...,...,...
196,197,Nyrielle_2,48,726,,-842.37,-90.45,461.67
197,198,Electra,48,93,eternal_night,-846.43,-86.57,459.72
198,199,Enyo,48,887,comets_rain,-849.34,-83.35,463.32
199,200,Iris_2,48,704,"pink_sun,frozen_oceans,magnetic_storms,sulfuri...",-846.93,-79.72,469.96
200,201,Sidera_2,48,252,"1000*C,diamond_rain",-848.59,-95.08,467.59

In [300]:
df_systems

,system_id,system,central_star,x_coord,y_coord,z_coord,galaxy_id
0,1,Celereus,Celereus Star,510.30,839.57,131.28,1
1,2,Celereus_2,Celereus Star,631.76,869.94,97.16,1
2,3,Omnix,Omnix Star,684.13,886.54,214.67,1
3,4,Aquila,Aquila Star,563.96,806.29,178.77,1
4,5,Ilyssar,Ilyssar Star,570.00,889.18,270.64,1
5,6,Aquila_2,Aquila Star,352.38,606.65,-156.99,2
6,7,Quirinius,Quirinius Star,198.34,586.12,-163.98,2
7,8,Juno,Juno Star,168.04,563.59,-258.34,2
8,9,Axioma,Axioma Star,-767.49,885.07,762.23,3
9,10,Solandis,Solandis Star,-891.94,745.15,724.60,3
10,11,Ixion,Ixion Star,-753.90,760.83,732.20,3
11,12,Nymerion,Nymerion Star,567.98,166.90,999.69,4
12,13,Jovar,Jovar Star,402.35,194.27,965.08,4
13,14,Ulthor,Ulthor Star,500.74,191.46,1048.06,4
14,15,Nymerion_2,Nymerion Star,472.53,43.69,1011.76,4
15,16,Karnis,Karnis Star,461.10,88.08,963.55,4
16,17,Mithra,Mithra Star,548.72,18.76,-921.80,5
17,18,Perseus,Perseus Star,507.67,-27.49,-931.75,5
18,19,Velorum,Velorum Star,639.53,-20.74,-1055.08,5
19,20,Apollo,Apollo Star,576.28,-77.55,-897.62,5
20,21,Hylon,Hylon Star,-171.54,-760.75,-142.04,6
21,22,Solandis_2,Solandis Star,-166.25,-745.29,-159.21,6
22,23,Hermes,Hermes Star,-194.93,-754.13,-74.31,6
23,24,Calyx,Calyx Star,-99.86,-651.22,24.33,6
24,25,Korralis,Korralis Star,332.86,1002.75,771.69,7
25,26,Korralis_2,Korralis Star,264.51,999.58,625.83,7
26,27,Orion,Orion Star,245.19,923.94,683.28,7
27,28,Orion_2,Orion Star,285.28,977.87,661.57,7
28,29,Solandis_3,Solandis Star,844.37,907.98,-388.95,8
29,30,Neptunus,Neptunus Star,817.55,883.83,-462.13,8
30,31,Zantheos,Zantheos Star,925.78,797.11,-440.00,8
31,32,Ixion_2,Ixion Star,818.89,868.82,-375.12,8
32,33,Vulcanus,Vulcanus Star,986.39,901.18,-386.28,8
33,34,Solandis_4,Solandis Star,-661.70,-912.68,-297.27,9
34,35,Thalos,Thalos Star,-766.28,-857.08,-345.56,9
35,36,Solanus,Solanus Star,-606.95,-862.10,-408.07,9
36,37,Jovar_2,Jovar Star,-728.30,-796.73,-333.92,9
37,38,Karnis_2,Karnis Star,-756.29,-1023.09,514.49,10
38,39,Solandis_5,Solandis Star,-865.96,-1031.91,397.40,10
39,40,Omnix_2,Omnix Star,-885.33,-920.69,490.15,10
40,41,Nymerion_3,Nymerion Star,-845.46,-1004.79,349.29,10
41,42,Vespera,Vespera Star,454.95,-486.78,339.16,11
42,43,Vespera_2,Vespera Star,583.65,-547.62,220.29,11
43,44,Dravon,Dravon Star,-811.29,-24.31,465.06,12
44,45,Ixion_3,Ixion Star,-861.08,-129.09,531.10,12
45,46,Galadrix,Galadrix Star,-881.64,-99.29,500.65,12
46,47,Dravon_2,Dravon Star,-882.95,-54.79,361.39,12
47,48,Typhonis,Typhonis Star,-846.00,-86.87,464.45,12

In [301]:
df_galaxies

    galaxy_id           galaxy
0           1    Zenithis Ring
1           2     Halion Verge
2           3     Quasari Belt
3           4        Voidspire
4           5   Crystara Bloom
5           6    Argent Spiral
6           7      Zenthos Arm
7           8    Polaris Nexus
8           9    Halcyon Drift
9          10   Oblivion Shard
10         11       Nemera Arc
11         12  Virelia Cluster

trip types

In [302]:
import math
import pandas as pd

# Zakładam, że df_planets już istnieje (jeśli nie, trzeba go wcześniej załadować z CSV)

# Step 1: Generate a trip type for each planet
trip_type = []

for i, row in df_planets.iterrows():
    distance_from_sun = math.sqrt(row["day0_x_coord"]**2 + row["day0_y_coord"]**2 + row["day0_z_coord"]**2)
    is_round_trip = distance_from_sun < 900  # one-way if far from (0,0,0)
    
    trip_type.append({
        "trip_type_id": i + 1,
        "name": f"Mission to {row['planet']}",
        "coordinates": f"X:{row['day0_x_coord']}, Y:{row['day0_y_coord']}, Z:{row['day0_z_coord']}",
        "description": f"Explore the unique surface and atmosphere of planet {row['planet']}.",
        "is_round_trip": is_round_trip,
        "planet_id": row["planet_id"],
        "orbital_period_days":row["orbit_period_days"] 
    })

# Convert to DataFrame and save
df_trip_type = pd.DataFrame(trip_type)
df_trip_type_final = df_trip_type.drop(columns=["orbital_period_days", "coordinates"])

# Zmień ścieżkę na swoją lokalną, np. na Pulpit
df_trip_type_final.to_csv("trip_type_final.csv", index=False)

# Show previe

In [303]:
df_trip_type_final

,trip_type_id,name,description,is_round_trip,planet_id
0,1,Mission to Pasiphae,Explore the unique surface and atmosphere of p...,False,1
1,2,Mission to Iaso,Explore the unique surface and atmosphere of p...,False,2
2,3,Mission to Noxia,Explore the unique surface and atmosphere of p...,False,3
3,4,Mission to Thalassa,Explore the unique surface and atmosphere of p...,False,4
4,5,Mission to Panacea,Explore the unique surface and atmosphere of p...,False,5
...,...,...,...,...,...
196,197,Mission to Nyrielle_2,Explore the unique surface and atmosphere of p...,False,197
197,198,Mission to Electra,Explore the unique surface and atmosphere of p...,False,198
198,199,Mission to Enyo,Explore the unique surface and atmosphere of p...,False,199
199,200,Mission to Iris_2,Explore the unique surface and atmosphere of p...,False,200
200,201,Mission to Sidera_2,Explore the unique surface and atmosphere of p...,False,201

employees

In [304]:
import random
import pandas as pd
from datetime import datetime, timedelta
from faker import Faker

fake = Faker()

positions = ["Technician", "Mission Specialist", "Commander", "Pilot", "Navigator"]
position_weights = [1, 1, 1, 3, 3]

salary_ranges = {
    "Technician": (4000, 6000),
    "Mission Specialist": (8000, 11000),
    "Commander": (9000, 12000),
    "Pilot": (6000, 8500),
    "Navigator": (5500, 8000)
}

# Parametry czasu
start_date = datetime(2023, 1, 1)
end_random_hire = datetime(2025, 6, 1)
today = datetime.today()

employees_data = []
num_employees = 100
pct_early_hires = 0.5
early_hires = int(num_employees * pct_early_hires)

for i in range(num_employees):
    first_name = fake.first_name()
    last_name = fake.last_name()

    position = random.choices(positions, weights=position_weights, k=1)[0]
    low, high = salary_ranges[position]

    # Hire date
    if i < early_hires:
        hire_date = start_date
    else:
        rand_days = random.randint(0, (end_random_hire - start_date).days)
        hire_date = start_date + timedelta(days=rand_days)

    # Staż w latach (pełne lata)
    years_worked = max(0, (today - hire_date).days // 365)

    # Wynagrodzenie bazowe + podwyżki
    base_salary = random.randrange(low, high + 1, 100)
    adjusted_salary = round(base_salary * (1.07 ** years_worked), -2)  # zaokrąglenie do setek

    employees_data.append({
        "employee_id": i + 1,
        "first_name": first_name,
        "last_name": last_name,
        "position": position,
        "hire_date": hire_date.strftime("%Y-%m-%d"),
        "salary": adjusted_salary
    })

# DataFrame
df_employees = pd.DataFrame(employees_data)
df_employees.to_csv("employee_final.csv", index=False)

trips+rocket

In [305]:
def is_employee_available(emp_id, new_start, new_end):
    for trip in trip_employees:
        if trip["employee_id"] == emp_id:
            # znajdź zakres dat tej misji
            trip_id = trip["trip_id"]
            trip_info = next((t for t in trips if t["trip_id"] == trip_id), None)
            if trip_info:
                existing_start = datetime.strptime(trip_info["departure_date"], "%Y-%m-%d")
                existing_end = datetime.strptime(trip_info["return_date"], "%Y-%m-%d")
                # sprawdź konflikt
                if not (new_end < existing_start or new_start > existing_end):
                    return False
    return True
# def is_employee_available(emp_id, new_start, new_end):
#     for record in trip_employees:
#         if record["employee_id"] == emp_id:
#             trip_info = next((t for t in trips if t["trip_id"] == record["trip_id"]), None)
#             if trip_info:
#                 existing_start = datetime.strptime(trip_info["departure_date"], "%Y-%m-%d")
#                 existing_end = datetime.strptime(trip_info["return_date"], "%Y-%m-%d")
#                 # Czy daty się pokrywają?
#                 if max(new_start, existing_start) <= min(new_end, existing_end):
#                     return False
#     return True

In [306]:
def pozycja_planety_w_czasie(x0, y0, z0, center, okres_dni, departure_dt):
    R = math.sqrt((x0 - center[0])**2 + (y0 - center[1])**2 + (z0 - center[2])**2)
    v0 = [x0 - center[0], y0 - center[1], z0 - center[2]]
    u = [x / math.sqrt(sum(i**2 for i in v0)) for x in v0]
    pomocniczy = [0, 1, 0] if abs(u[0]) < 1e-6 and abs(u[1]) < 1e-6 else [0, 0, 1]

    v_temp = [
        u[1]*pomocniczy[2] - u[2]*pomocniczy[1],
        u[2]*pomocniczy[0] - u[0]*pomocniczy[2],
        u[0]*pomocniczy[1] - u[1]*pomocniczy[0]
    ]
    v_magnitude = math.sqrt(sum(i**2 for i in v_temp))
    v = [i / v_magnitude for i in v_temp]

    omega = 2 * math.pi / (okres_dni * 24)  
    t = (departure_dt - datetime(2023, 1, 1)).total_seconds() / 3600 
    theta = omega * t
    cos_t, sin_t = math.cos(theta), math.sin(theta)
    pos = [
        center[0] + R * cos_t * u[0] + R * sin_t * v[0],
        center[1] + R * cos_t * u[1] + R * sin_t * v[1],
        center[2] + R * cos_t * u[2] + R * sin_t * v[2],
    ]
    return pos

In [307]:
import math

def oblicz_cel_lotu_3d(
    start_rakiety,
    predkosc_rakiety_kmh,
    jednostka_km,
    srodek_orbity,
    pozycja_planety_start,
    okres_orbitalny_dni,
    epsilon=1e-5,
    max_iter=100000
):
    def dystans3d(p1, p2):
        return math.sqrt(
            (p1[0] - p2[0])**2 +
            (p1[1] - p2[1])**2 +
            (p1[2] - p2[2])**2
        )

    def wektor_sub(a, b):
        return [a[i] - b[i] for i in range(3)]

    def wektor_add(a, b):
        return [a[i] + b[i] for i in range(3)]

    def skalar_krotka(k, v):
        return [k * x for x in v]

    def normalizuj(v):
        d = math.sqrt(sum(x**2 for x in v))
        return [x / d for x in v]

    def cross(a, b):
        return [
            a[1]*b[2] - a[2]*b[1],
            a[2]*b[0] - a[0]*b[2],
            a[0]*b[1] - a[1]*b[0]
        ]

    # --- Przygotowanie orbity w przestrzeni 3D ---
    R = dystans3d(pozycja_planety_start, srodek_orbity)
    v0 = wektor_sub(pozycja_planety_start, srodek_orbity)
    u = normalizuj(v0)

    # Znajdź drugi wektor ortonormalny
    if abs(u[0]) < 1e-6 and abs(u[1]) < 1e-6:
        pomocniczy = [0, 1, 0]
    else:
        pomocniczy = [0, 0, 1]

    v = normalizuj(cross(u, pomocniczy))
    w = cross(v, u)  # finalne u, v – ortonormalna baza płaszczyzny orbity

    # Kąt początkowy (theta = 0 to pozycja startowa)
    theta0 = 0
    omega = 2 * math.pi / (okres_orbitalny_dni * 24)  # rad/h

    def pozycja_planety(t):
        theta = theta0 + omega * t
        cos_t = math.cos(theta)
        sin_t = math.sin(theta)
        pos = wektor_add(
            srodek_orbity,
            skalar_krotka(R * cos_t, u)
        )
        pos = wektor_add(
            pos,
            skalar_krotka(R * sin_t, v)
        )
        return tuple(pos)

    # Szacowanie czasu
    dyst_do_srodka = dystans3d(start_rakiety, srodek_orbity)
    d_min = max(0, dyst_do_srodka - R)
    d_max = dyst_do_srodka + R

    t_min = (d_min * jednostka_km) / predkosc_rakiety_kmh
    t_max = (d_max * jednostka_km) / predkosc_rakiety_kmh

    najlepszy_t = None
    najmniejszy_blad = float('inf')

    for _ in range(max_iter):
        t_mid = (t_min + t_max) / 2
        pos_planety = pozycja_planety(t_mid)

        dyst = dystans3d(start_rakiety, pos_planety) * jednostka_km
        t_lot = dyst / predkosc_rakiety_kmh

        blad = abs(t_lot - t_mid)

        if blad < najmniejszy_blad:
            najmniejszy_blad = blad
            najlepszy_t = t_mid

        if blad < epsilon:
            return t_mid, pos_planety

        if t_lot > t_mid:
            t_min = t_mid
        else:
            t_max = t_mid

    print(f"⚠️ Osiągnięto limit iteracji ({max_iter}), zwracam najlepsze przybliżenie.")
    return najlepszy_t, pozycja_planety(najlepszy_t)

In [308]:
from datetime import datetime, timedelta
import random
from tqdm import tqdm  # Dodaj pasek postępu
from itertools import count


rockets = ['Stellar Vortex', 'Nebula Strider', 'Quantum Lance', 'Solaris Ark']
employees_roles = ["Technician", "Mission Specialist", "Commander", "Pilot", "Navigator"]
start_date = datetime(2023, 1, 1)
trips = []
trip_employees = []
k=0
# Dodaj pasek postępu dla trip_type
for i, row in tqdm(df_trip_type.iterrows(), total=len(df_trip_type), desc="Generowanie misji"):
    num_variants = random.randint(1, 3)
    for _ in range(num_variants):
        trip_id = len(trips) + 1
        departure = start_date + timedelta(days=random.randint(0, 600))
        duration = random.randint(5, 30)
        speed = random.uniform(1000 * 60 * 60, 300000 * 60 * 60)  # km/h
        rocket_id = random.randint(1, len(rockets))

        # PLANETA STARTOWA: 4
        planeta_4 = df_planets[df_planets["planet_id"] == 4].iloc[0]
        system_4 = df_systems[df_systems["system_id"] == planeta_4["system_id"]].iloc[0]
        start_rakiety = pozycja_planety_w_czasie(
            planeta_4["day0_x_coord"],
            planeta_4["day0_y_coord"],
            planeta_4["day0_z_coord"],
            [system_4["x_coord"], system_4["y_coord"], system_4["z_coord"]],
            planeta_4["orbit_period_days"],
            departure
        )

        # CEL: planeta docelowa i jej system
        planet_id = row["planet_id"]
        planet_row = df_planets[df_planets["planet_id"] == planet_id].iloc[0]
        system_row = df_systems[df_systems["system_id"] == planet_row["system_id"]].iloc[0]
        srodek_orbity = [system_row["x_coord"], system_row["y_coord"], system_row["z_coord"]]
        pozycja_planety_start = [planet_row["day0_x_coord"], planet_row["day0_y_coord"], planet_row["day0_z_coord"]]
        okres_orbitalny_dni = planet_row["orbit_period_days"]

        time_hours, _ = oblicz_cel_lotu_3d(
            start_rakiety=start_rakiety,
            predkosc_rakiety_kmh=speed,
            jednostka_km=50000,
            srodek_orbity=srodek_orbity,
            pozycja_planety_start=pozycja_planety_start,
            okres_orbitalny_dni=okres_orbitalny_dni
        )
        time_days = time_hours / 24

        if row["is_round_trip"]:
            total_days = 2 * time_days + duration
        else:
            total_days = time_days + duration
        return_date = departure + timedelta(days=total_days)

        trips.append({
            "trip_id": trip_id,
            "trip_type_id": row["trip_type_id"],
            "rocket_id": rocket_id,
            "departure_date": departure.strftime("%Y-%m-%d"),
            "return_date": return_date.strftime("%Y-%m-%d"),
            "status": random.choice(["Scheduled", "Completed", "Delayed"]),
            "speed": speed
        })

        # Przypisz pracowników
        is_round_trip = row["is_round_trip"]
        min_roles = ["Pilot", "Navigator"]
        other_roles = ["Technician", "Mission Specialist", "Commander"]
        n_optional = random.randint(1, 2) if is_round_trip else 0
        assigned = []

        for role in min_roles:
            available = [e for e in employees_data if e["position"] == role and
                         is_employee_available(e["employee_id"], departure, return_date)]
            if not available:
                raise ValueError(f"No available employee for role: {role} (without conflict)")
            emp = random.choice(available)
            assigned.append(emp["employee_id"])
            k+=1
            trip_employees.append({
                "trip_employee_id": k,
                "role_in_trip": emp["position"],
                "employee_id": emp["employee_id"],
                "trip_id": trip_id
            })
            
            
        for _ in range(n_optional):
            available = [e for e in employees_data if e["position"] in other_roles and
                         is_employee_available(e["employee_id"], departure, return_date)]
            if available:
                k+=1
                emp = random.choice(available)
                assigned.append(emp["employee_id"])
                trip_employees.append({
                "trip_employee_id": k,
                    "trip_id": trip_id,
                    "employee_id": emp["employee_id"],
                    "role_in_trip": emp["position"]
                })
rocket_data = [
    {"rocket_id": 1, "name": "Stellar Vortex", "capacity": 6},
    {"rocket_id": 2, "name": "Nebula Strider", "capacity": 10},
    {"rocket_id": 3, "name": "Quantum Lance", "capacity": 4},
    {"rocket_id": 4, "name": "Solaris Ark", "capacity": 8},
]

df_rockets = pd.DataFrame(rocket_data)

# Eksport danych
df_trips = pd.DataFrame(trips)
df_trip_employees = pd.DataFrame(trip_employees)


df_trips.to_csv("trip_final.csv", index=False)
df_trip_employees.to_csv("trip_employee_final.csv", index=False)
df_rockets.to_csv("rocket_final.csv", index=False)

Generowanie misji:   0%|          | 0/201 [00:00<?, ?it/s]

Generowanie misji: 100%|██████████| 201/201 [00:04<00:00, 46.98it/s]

In [309]:
df_trip_employees

     trip_employee_id role_in_trip  employee_id  trip_id
0                   1        Pilot           58        1
1                   2    Navigator           72        1
2                   3        Pilot           18        2
3                   4    Navigator           85        2
4                   5        Pilot           58        3
..                ...          ...          ...      ...
944               945    Navigator           70      412
945               946        Pilot           93      413
946               947    Navigator           53      413
947               948        Pilot           93      414
948               949    Navigator           80      414

[949 rows x 4 columns]

najbardziej sie spoznia - quantum lance

In [310]:
# from datetime import datetime, timedelta
# import random
# import pandas as pd

# # Dane bazowe
# rockets = ['Stellar Vortex', 'Nebula Strider', 'Quantum Lance', 'Solaris Ark']
# employees_data = [
#     {"employee_id": i + 1, "position": pos}
#     for i, pos in enumerate(["Technician", "Mission Specialist", "Commander", "Pilot", "Navigator"] * 10)
# ]
# start_date = datetime(2023, 1, 1)
# cutoff_date = datetime(2025, 6, 1)
# delayed_rocket = "Quantum Lance"

# # Przygotowanie
# trips = []
# trip_employees = []

# for i, row in df_trip_type.iterrows():
#     num_variants = random.randint(1, 3)
#     for _ in range(num_variants):
#         trip_id = len(trips) + 1
#         departure = start_date + timedelta(days=random.randint(0, 1500))
#         duration = random.randint(5, 30)
#         return_date = departure + timedelta(days=duration)
#         rocket_id = random.randint(1, len(rockets))
#         rocket_name = rockets[rocket_id - 1]

#         # Status logic
#         if return_date < cutoff_date:
#             status = "Completed"
#         elif rocket_name == delayed_rocket:
#             status = "Delayed"
#         else:
#             status = random.choice(["Scheduled", "Delayed"])

#         trips.append({
#             "trip_id": trip_id,
#             "trip_type_id": row["trip_type_id"],
#             "rocket_id": rocket_id,
#             "departure_date": departure.strftime("%Y-%m-%d"),
#             "return_date": return_date.strftime("%Y-%m-%d"),
#             "status": status
#         })

#         is_round_trip = row["is_round_trip"]
#         min_roles = ["Pilot", "Navigator"]
#         other_roles = ["Technician", "Mission Specialist", "Commander"]
#         n_optional = random.randint(1, 2) if is_round_trip else 0

#         assigned = []# Dodaj obowiązkowego Pilota i Nawigatora
#         for role in ["Pilot", "Navigator"]:
#             available = [
#         e for e in employees_data
#         if e["position"] == role
#         and e["employee_id"] not in assigned
#         and is_employee_available(e["employee_id"], departure, return_date)
#     ]
    
#             if not available:
#                 raise ValueError(f"No available employee for role: {role} (without conflict)")
    
#             emp = random.choice(available)
#             assigned.append(emp["employee_id"])
#             trip_employees.append({
#         "trip_id": trip_id,
#         "employee_id": emp["employee_id"],
#         "role_in_trip": emp["position"]
#     })

        

#         for _ in range(n_optional):
#             available = [e for e in employees_data if e["position"] in other_roles and e["employee_id"] not in assigned]
#             if available:
#                 emp = random.choice(available)
#                 assigned.append(emp["employee_id"])
#                 trip_employees.append({
#                     "trip_id": trip_id,
#                     "employee_id": emp["employee_id"],
#                     "role_in_trip": emp["position"]
#                 })

# # DataFrames
# df_trips = pd.DataFrame(trips)
# df_trip_employees = pd.DataFrame(trip_employees)
# df_employees = pd.DataFrame(employees_data)
# rocket_data = [
#     {"rocket_id": 1, "name": "Stellar Vortex", "capacity": 6},
#     {"rocket_id": 2, "name": "Nebula Strider", "capacity": 10},
#     {"rocket_id": 3, "name": "Quantum Lance", "capacity": 4},
#     {"rocket_id": 4, "name": "Solaris Ark", "capacity": 8},
# ]

# df_rockets = pd.DataFrame(rocket_data)

# # # Save
# # df_trips.to_csv("trips_generated.csv", index=False)
# # df_trip_employees.to_csv("trip_employees.csv", index=False)
# # df_employees.to_csv("employees_generated.csv", index=False)
# # df_rockets.to_csv("rockets_generated.csv", index=False)

In [311]:
df_trips

,trip_id,trip_type_id,rocket_id,departure_date,return_date,status,speed
0,1,1,3,2023-05-18,2023-06-10,Delayed,7.788122e+08
1,2,2,3,2023-04-21,2023-05-05,Completed,1.030496e+09
2,3,2,2,2023-01-30,2023-03-01,Scheduled,1.072683e+09
3,4,3,1,2023-12-24,2024-01-03,Completed,3.096570e+08
4,5,3,3,2023-07-06,2023-07-21,Scheduled,5.196089e+08
...,...,...,...,...,...,...,...
409,410,199,1,2024-06-16,2024-06-27,Scheduled,1.572677e+08
410,411,200,3,2023-05-05,2023-05-10,Completed,4.410545e+08
411,412,200,1,2023-03-20,2023-03-29,Scheduled,7.765910e+08
412,413,200,4,2024-07-13,2024-08-02,Scheduled,1.038765e+09
413,414,201,2,2023-07-09,2023-08-03,Delayed,4.701590e+08

transaction + booking

In [312]:
import math
import random
from faker import Faker
from tqdm import tqdm  # Dodaj pasek postępu
from datetime import datetime

fake = Faker()

# Step 1: Generate clients
clients = [{
    "client_id": i + 1,
    "first_name": fake.first_name(),
    "last_name": fake.last_name(),
    "client_contact_id": i + 1,
    "emergency_contact_id": i + 1
} for i in range(50)]
df_clients = pd.DataFrame(clients)

emergency_contact = [{
    "emergency_contact_id": i + 1,
    "phone": fake.phone_number(),
    "email": fake.email()
} for i in range(50)]
df_emergency_contact = pd.DataFrame(emergency_contact)

client_contact = [{
    "client_contact_id": i + 1,
    "phone": fake.phone_number(),
    "email": fake.email()
} for i in range(50)]
df_client_contact = pd.DataFrame(client_contact)

# Step 2: Generate bookings
bookings = []
for client in clients:
    n_bookings = random.randint(1, 3)
    booked_trip_ids = random.sample(df_trips["trip_id"].tolist(), n_bookings)
    for trip_id in booked_trip_ids:
        bookings.append({
            "booking_id": len(bookings) + 1,
            "seat_number": random.randint(1, 12),
            "client_id": client["client_id"],
            "trip_id": trip_id
        })
df_bookings = pd.DataFrame(bookings)

# Pre-map data
planet_coords = df_trip_type.set_index("trip_type_id")["coordinates"].to_dict()
round_trip_flags = df_trip_type.set_index("trip_type_id")["is_round_trip"].to_dict()
trip_types_planet = df_trip_type.set_index("trip_type_id")["planet_id"].to_dict()
rockets_capacity = df_rockets.set_index("rocket_id")["capacity"].to_dict()

booking_seat_counts = df_bookings.groupby(["client_id", "trip_id"]).size().to_dict()

transactions = []

# 🧠 Cache start rakiety z planety 4
planeta_4 = df_planets[df_planets["planet_id"] == 4].iloc[0]
system_4 = df_systems[df_systems["system_id"] == planeta_4["system_id"]].iloc[0]

# ⏳ Pasek postępu
for booking in tqdm(bookings, desc="Przetwarzanie transakcji"):
    trip_id = booking["trip_id"]
    trip_row = df_trips[df_trips["trip_id"] == trip_id].iloc[0]
    trip_type_id = trip_row["trip_type_id"]
    rocket_id = trip_row["rocket_id"]
    departure = datetime.strptime(trip_row["departure_date"], "%Y-%m-%d")
    speed = trip_row["speed"]

    # PLANETA DOCELOWA
    planet_id = trip_types_planet[trip_type_id]
    planet_row = df_planets[df_planets["planet_id"] == planet_id].iloc[0]
    system_row = df_systems[df_systems["system_id"] == planet_row["system_id"]].iloc[0]
    srodek_orbity = [system_row["x_coord"], system_row["y_coord"], system_row["z_coord"]]
    pozycja_planety_start = [planet_row["day0_x_coord"], planet_row["day0_y_coord"], planet_row["day0_z_coord"]]
    okres_orbitalny_dni = planet_row["orbit_period_days"]

    # START rakiety
    start_rakiety = pozycja_planety_w_czasie(
        planeta_4["day0_x_coord"],
        planeta_4["day0_y_coord"],
        planeta_4["day0_z_coord"],
        [system_4["x_coord"], system_4["y_coord"], system_4["z_coord"]],
        planeta_4["orbit_period_days"],
        departure
    )

    # CEL – aktualna pozycja planety docelowej
    _, pozycja_docelowa = oblicz_cel_lotu_3d(
        start_rakiety=start_rakiety,
        predkosc_rakiety_kmh=speed,
        jednostka_km=50000,
        srodek_orbity=srodek_orbity,
        pozycja_planety_start=pozycja_planety_start,
        okres_orbitalny_dni=okres_orbitalny_dni
    )

    # OBLICZ dystans
    distance = math.sqrt(sum((a - b) ** 2 for a, b in zip(start_rakiety, pozycja_docelowa)))

    # CENA
    employee_count = df_trip_employees[df_trip_employees["trip_id"] == trip_id].shape[0]
    key = (booking["client_id"], trip_id)
    num_seats = booking_seat_counts.get(key, 1)

    base_price = 10000
    base_price += num_seats * 200
    base_price += (distance / 10)
    base_price += rockets_capacity[rocket_id] * 100
    base_price += employee_count * 150
    if round_trip_flags[trip_type_id]:
        base_price *= 1.25

    # Sprawdź duplikaty
    if key not in {(t["client_id"], t["trip_id"]) for t in transactions}:
        transactions.append({
            "transaction_id": len(transactions) + 1,
            "amount": round(base_price, 2),
            "method": random.choice(["card", "transfer", "crypto"]),
            "payment_date": fake.date_between(start_date='-1y', end_date='today').strftime("%Y-%m-%d"),
            "trip_id": trip_id,
            "client_id": booking["client_id"],
            "num_seats": num_seats
        })

# Finalna tabela
df_transactions = pd.DataFrame(transactions)

# Zapisz dane
df_clients.to_csv("client_final.csv", index=False)

df_client_contact.to_csv("client_contact_final.csv", index=False)

df_emergency_contact.to_csv("emergency_contact_final.csv", index=False)

df_booking_final=df_bookings.drop(columns=["seat_number"])
df_booking_final.to_csv("booking_final.csv", index=False)

df_transactions_final=df_transactions.drop(columns=["num_seats"])
df_transactions_final.to_csv("transaction_final.csv", index=False)

Przetwarzanie transakcji: 100%|██████████| 101/101 [00:00<00:00, 760.64it/s]

In [313]:
import math
import random
import pandas as pd
from faker import Faker
from datetime import datetime

fake = Faker()

# Step 1: Generate clients
clients = []

for i in range(50):
    first = fake.first_name()
    last = fake.last_name()
    email_user = f"{first}.{last}".lower().replace(" ", "")
    domain = fake.free_email_domain()
    email = f"{email_user}@{domain}"
    
    clients.append({
        "client_id": i + 1,
        "first_name": first,
        "last_name": last
    })


df_clients = pd.DataFrame(clients)

# Step 2: Generate bookings (1–3 per client, max rocket capacity, seats obok siebie)
trip_capacity = df_rockets.set_index("rocket_id")["capacity"].to_dict()
trip_booked_seats = {trip_id: set() for trip_id in df_trips["trip_id"]}

bookings = []

for client in clients:
    n_reservations = random.randint(1, 3)
    available_trip_ids = df_trips["trip_id"].tolist()
    random.shuffle(available_trip_ids)
    chosen_trips = available_trip_ids[:n_reservations]

    for trip_id in chosen_trips:
        rocket_id = df_trips.loc[df_trips["trip_id"] == trip_id, "rocket_id"].values[0]
        capacity = trip_capacity[rocket_id]
        booked_seats = trip_booked_seats[trip_id]

        requested_seats = random.randint(1, 3)
        available_seats = sorted(set(range(1, capacity + 1)) - booked_seats)

        # Znajdź sąsiednie miejsca
        seat_block = None
        for i in range(len(available_seats) - requested_seats + 1):
            block = available_seats[i:i + requested_seats]
            if block[-1] - block[0] == requested_seats - 1:
                seat_block = block
                break

        if seat_block:
            for seat in seat_block:
                bookings.append({
                    "booking_id": len(bookings) + 1,
                    "client_id": client["client_id"],
                    "trip_id": trip_id,
                    "seat_number": seat
                })
                trip_booked_seats[trip_id].add(seat)

df_bookings = pd.DataFrame(bookings)

# Step 3: Generate transactions
planet_coords = df_trip_type.set_index("trip_type_id")["coordinates"].to_dict()
round_trip_flags = df_trip_type.set_index("trip_type_id")["is_round_trip"].to_dict()
rockets_capacity = df_rockets.set_index("rocket_id")["capacity"].to_dict()

# Seats per (client_id, trip_id)
booking_seat_counts = df_bookings.groupby(["client_id", "trip_id"]).size().to_dict()

transactions = []
existing_keys = set()

for booking in bookings:
    trip_id = booking["trip_id"]
    client_id = booking["client_id"]
    key = (client_id, trip_id)

    if key in existing_keys:
        continue
    existing_keys.add(key)

    trip_row = df_trips[df_trips["trip_id"] == trip_id].iloc[0]
    trip_type_id = trip_row["trip_type_id"]
    rocket_id = trip_row["rocket_id"]
    coords = planet_coords[trip_type_id]
    
    # Parse coordinates
    coord_parts = [float(val.split(":")[1]) for val in coords.split(", ")]
    distance = math.sqrt(sum(c ** 2 for c in coord_parts))
    
    employee_count = df_trip_employees[df_trip_employees["trip_id"] == trip_id].shape[0]
    num_seats = booking_seat_counts.get(key, 1)

    base_price = 50000
    base_price += num_seats * 10000
    base_price += (distance / 10)
    base_price += rockets_capacity[rocket_id] * 1000
    base_price += employee_count * 15000
    if round_trip_flags[trip_type_id]:
        base_price *= 1.25

    amount = round(base_price, 2)

    transactions.append({
        "transaction_id": len(transactions) + 1,
        "client_id": client_id,
        "trip_id": trip_id,
        "num_seats": num_seats,
        "amount": amount,
        "payment_date": fake.date_between(start_date='-1y', end_date='today').strftime("%Y-%m-%d"),
        "method": random.choice(["card", "transfer", "crypto"])
    })

df_transactions = pd.DataFrame(transactions)

In [314]:
df_transactions

,transaction_id,client_id,trip_id,num_seats,amount,payment_date,method
0,1,1,175,2,156349.25,2024-09-03,transfer
1,2,1,167,2,104106.03,2024-12-26,card
2,3,2,216,3,114131.49,2024-10-18,card
3,4,2,100,2,110130.06,2025-01-11,crypto
4,5,2,373,3,114093.41,2025-02-04,card
...,...,...,...,...,...,...,...
96,97,48,291,3,118120.27,2024-11-30,card
97,98,48,410,2,106097.11,2024-10-18,crypto
98,99,49,94,1,98130.54,2024-10-09,crypto
99,100,49,32,2,110100.38,2024-07-27,transfer
100,101,50,46,2,110109.76,2024-10-19,card

In [315]:
df_bookings

     booking_id  client_id  trip_id  seat_number
0             1          1      175            1
1             2          1      175            2
2             3          1      167            1
3             4          1      167            2
4             5          2      216            1
..          ...        ...      ...          ...
196         197         49       94            3
197         198         49       32            1
198         199         49       32            2
199         200         50       46            1
200         201         50       46            2

[201 rows x 4 columns]

In [316]:
df_clients

    client_id   first_name   last_name
0           1        James     Nichols
1           2      Marissa      Lucero
2           3       Sheila      Howell
3           4        Wendy       Smith
4           5     Lorraine    Robinson
5           6     Victoria      Garcia
6           7      Michele       Lopez
7           8        Donna       Meyer
8           9        Jacob       Baker
9          10         Erin    Saunders
10         11    Elizabeth      Barron
11         12       Robert      Henson
12         13         Ryan    Mcdowell
13         14         Noah     Roberts
14         15       Taylor      Nelson
15         16        Sarah      Hughes
16         17       Amanda    Chandler
17         18       Stacey       Brown
18         19         Erin       Jones
19         20      Kenneth       Lewis
20         21        Devin      Greene
21         22        James       Smith
22         23     Brittany      Lawson
23         24        Casey     Houston
24         25        Debra       Ramos
25         26  Christopher     Douglas
26         27      Krystal        King
27         28     Samantha     Douglas
28         29         Mary       White
29         30    Elizabeth        Hall
30         31      Rebecca  Williamson
31         32       Joshua       Clark
32         33       Angela      Miller
33         34         Mary      Hebert
34         35      Rebecca      Taylor
35         36       Robert       Smith
36         37  Christopher       Young
37         38       Brandy       Sloan
38         39      Maurice      French
39         40  Christopher      Taylor
40         41      Deborah    Martinez
41         42       Sharon        Wade
42         43        James        Sims
43         44      Vanessa      Howard
44         45          Kim    Holloway
45         46         Ryan      Chavez
46         47        James      Hayden
47         48         Anna      Martin
48         49       Hannah       Tyler
49         50         Mary       Smith

cost

In [317]:

# Count employees per trip
employee_counts = df_trip_employees.groupby("trip_id").size().to_dict()
# Sum of transactions per trip
income_per_trip = df_transactions.groupby("trip_id")["amount"].sum().to_dict()
# trip_type info
planet_coords = df_trip_type.set_index("trip_type_id")["coordinates"].to_dict()
round_trip_flags = df_trip_type.set_index("trip_type_id")["is_round_trip"].to_dict()

costs = []
for trip in df_trips.itertuples():
    trip_id = trip.trip_id
    trip_type_id = trip.trip_type_id
    coords = planet_coords[trip_type_id]
    coord_parts = [float(val.split(":")[1]) for val in coords.split(", ")]
    distance = math.sqrt(sum(c ** 2 for c in coord_parts))
    is_round = round_trip_flags[trip_type_id]
    n_employees = employee_counts.get(trip_id, 1)
    max_total_cost = income_per_trip.get(trip_id, 10000)

    # Base cost estimate
    base_cost = 70000 + (n_employees * 3000) + (distance / 20)
    if is_round:
        base_cost *= 1.4

    # Generate 2-4 individual costs that sum up to less than income
    total_cost = min(base_cost, max_total_cost * 0.9)
    n_costs = random.randint(2, 4)
    cost_shares = [random.uniform(0.15, 0.35) for _ in range(n_costs)]
    total_share = sum(cost_shares)
    normalized_shares = [s / total_share for s in cost_shares]

    for i in range(n_costs):
        costs.append({
            "cost_id": len(costs) + 1,
            "trip_id": trip_id,
            "description": random.choice(["Fuel", "Crew", "Maintenance", "Logistics"]),
            "amount": round(total_cost * normalized_shares[i], 2)
        })

df_costs = pd.DataFrame(costs)
df_costs.to_csv("cost_final.csv", index=False)
df_costs
# # Preview costs
# import ace_tools as tools; tools.display_dataframe_to_user(name="Generated Costs", dataframe=df_costs)

      cost_id  trip_id  description    amount
0           1        1    Logistics   2560.39
1           2        1         Fuel   2042.18
2           3        1         Crew   2153.35
3           4        1    Logistics   2244.08
4           5        2    Logistics   1846.04
...       ...      ...          ...       ...
1230     1231      413  Maintenance   4295.85
1231     1232      414  Maintenance  15139.28
1232     1233      414         Crew  20082.55
1233     1234      414         Fuel  24953.75
1234     1235      414    Logistics  15873.10

[1235 rows x 4 columns]

clients + adress + emergency_contact

In [318]:
# Filter clients based on their bookings and trip directions
# Also identify the two galaxies with most round-trip clients

# First, merge trip info into bookings
df_booking_trips = df_bookings.merge(df_trips, on="trip_id", how="left")
df_booking_trips = df_booking_trips.merge(df_trip_type[["trip_type_id", "is_round_trip", "planet_id"]], on="trip_type_id", how="left")
df_booking_trips = df_booking_trips.merge(df_planets[["planet_id", "system_id"]], on="planet_id", how="left")

# Step 1: Remove clients who took at least one one-way trip
one_way_clients = df_booking_trips[df_booking_trips["is_round_trip"] == False]["client_id"].unique()
df_clients_filtered = df_clients[~df_clients["client_id"].isin(one_way_clients)]

# Step 2: For remaining clients, count round-trip bookings per galaxy
round_trip_bookings = df_booking_trips[
    (df_booking_trips["is_round_trip"] == True) &
    (df_booking_trips["client_id"].isin(df_clients_filtered["client_id"]))
]

galaxy_counts = round_trip_bookings.groupby("system_id").size().sort_values(ascending=False)
top_two_galaxies = galaxy_counts.head(2).index.tolist()

# Step 3: Select clients who traveled to those galaxies
top_clients = round_trip_bookings[round_trip_bookings["system_id"].isin(top_two_galaxies)]["client_id"].unique()
df_clients_top = df_clients_filtered[df_clients_filtered["client_id"].isin(top_clients)]

# Step 4: Add fake address and emergency contact info
from faker import Faker
fake = Faker()

addresses = []
emergency_contacts = []

for _, client_row in df_clients_top.iterrows():
    client_id = client_row["client_id"]
    first = client_row["first_name"].lower()
    last = client_row["last_name"].lower()
    email_username = f"{first}.{last}".replace(" ", "")
    domain = fake.free_email_domain()
    client_email = f"{email_username}@{domain}"

    # Zaktualizuj email klienta w df_clients_top
    df_clients_top.loc[df_clients_top["client_id"] == client_id, "email"] = client_email

    # Adres
    addresses.append({
        "client_id": client_id,
        "street": fake.street_address(),
        "city": fake.city(),
        "postal_code": fake.postcode(),
        "country": fake.country()
    })

    # Emergency contact (anonimowy)
    emergency_contacts.append({
        "emergency_contact_id": client_id,
        "email": fake.email(),
        "phone": fake.phone_number() 

    })


df_addresses = pd.DataFrame(addresses)
df_addresses
# Save updated data
# df_clients_top.to_csv("clients_final.csv", index=False)
# df_addresses.to_csv("addresses_final.csv", index=False)
df_emergency_contacts = pd.DataFrame(emergency_contacts)
#df_emergency_contacts.to_csv("emergency_contacts.csv", index=False)


# Show clients selected
#import ace_tools as tools; tools.display_dataframe_to_user(name="Final Clients (Round Trip & Top Galaxies)", dataframe=df_clients_top)

In [319]:
df_clients_top

    client_id first_name last_name                       email
10         11  Elizabeth    Barron  elizabeth.barron@yahoo.com
16         17     Amanda  Chandler   amanda.chandler@yahoo.com
24         25      Debra     Ramos     debra.ramos@hotmail.com
26         27    Krystal      King    krystal.king@hotmail.com